app/Controllers/AdminCategory.php

SELECT *
FROM `category`
---
    public function index()
    {
        $model = new AdminCategoryModel();
        $data['categories'] = $model->findAll(); // Tüm kategorileri getir