app/Controllers/AdminComment.php

    public function index()
    {
        $commentModel = new CommentModel();
        $comments = $commentModel->findAll(); // Tüm yorumları al
---
SELECT *
FROM `comment`