app/Controllers/Blog.php

    public function view($post_id)
    {
        $postModel = new PostModel();
        $commentModel = new CommentModel();
        $postLikeModel = new PostLikeModel();

        // Gönderiyi al
        $post = $postModel->find($post_id);

        // Gönderiye ait yorumları al
        $comments = $commentModel->where('post_id', $post_id)->findAll() ?? [];

        // Gönderiye ait toplam beğeni sayısını al
        $likeCount = $postLikeModel->where('post_id', $post_id)->countAllResults();
---
SELECT *
FROM `post`
WHERE `post`.`post_id` = '10'
SELECT *
FROM `comment`
WHERE `post_id` = '10'
SELECT COUNT(*) AS `numrows`
FROM `post_like`
WHERE `post_id` = '10'

    public function index()
    {
        $session = session();
        $logged = $session->has('user_id') && $session->has('username');
        $user_id = $session->get('user_id') ?? null;

        $postModel = new PostModel();
        $categoryModel = new CategoryModel();
        $postLikeModel = new PostLikeModel();

        // Tüm postları ve kategorileri al
        $posts = $postModel->findAll();
        $categories = $categoryModel->findAll();
---
SELECT *
FROM `post`
SELECT *
FROM `category`