app/Controllers/Users.php

    public function index()
    {
        $model = new UsersModel();
        $data['users'] = $model->findAll(); // Veritabanından tüm kullanıcıları alır.
---
SELECT *
FROM `users`