app/Models/AdminModel.php

SELECT *
FROM `admin`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function validateAdmin($username, $password)
    {
        $user = $this->where('username', $username)->first();