app/Models/AdminPostModel.php

SELECT `post`.`post_id`, `post`.`post_title`, `category`.`category` AS `category_name`, `post`.`publish`
FROM `post`
JOIN `category` ON `category`.`id` = `post`.`category`
---
    public function getPostsWithCategories()
    {
        return $this->select('post.post_id, post.post_title, category.category AS category_name, post.publish')
            ->join('category', 'category.id = post.category') // Kategorilerle birleştirme
            ->findAll();