app/Models/CategoryModel.php

SELECT *
FROM `category`
---
    public function getAllCategories()
    {
        return $this->findAll(); // tüm kategorileri almak için