app/Models/PostLikeModel.php

SELECT COUNT(*) AS `numrows`
FROM `post_like`
WHERE `post_id` = '10'
---
    public function getLikeCount($postId)
    {
        return $this->where('post_id', $postId)->countAllResults();